In [6]:
#if else statement
a =33
b =220
if b>a:
    print(' b is greater than a')

 b is greater than a

In [7]:
a =22
b =23
if b>a:
    print('b greater than a')
elif a==b:
    print(' a equal to b')

b greater than a

In [8]:
a =10
b =10
if a>b:
    print('a greater than b')
elif a==b:
    print('a equal to b')

a equal to b

In [9]:
a = 20
b =10
print('a is greater than b ')if a>b else print('b greater than a')

a is greater than b

In [10]:
a =20
b =23
if b>a:
    pass

In [11]:
# while loop demo
i =1
while i<6:
    print(i)
    i+=1

1
2
3
4
5

In [ ]:
j=5
while j>10:
    print('j')
    j-=1

In [1]:
for x in range(3):
    print(x)

0
1
2

In [2]:
for i in range(2,4):
    print(i)

2
3

In [3]:
for i in range (2,20,5):
    print(i)

2
7
12
17

In [5]:
for x in range(10):
    print(x)
else:
    print('finished')

0
1
2
3
4
5
6
7
8
9
finished

In [6]:
adj =['red','big','tasty']
fruits=['apple','banana','cherry']
for x in adj:
    for y in fruits:
        print(x,y)

red apple
red banana
red cherry
big apple
big banana
big cherry
tasty apple
tasty banana
tasty cherry

In [7]:
for x in [0,1,2]:
    pass

In [13]:
x=5
while x<6:
    print(x)
    x+=1

5

In [14]:
# creating dataframe

In [15]:
import pandas as pd
import numpy as np

In [20]:
data = pd.DataFrame({'fruits':['mango','banana','','papaya','NaN',np.nan],'quantity':[1,2,3,4,5,6,],'price in rupees':[100,50,0,50,0,0]})

In [21]:
data

   fruits  quantity  price in rupees
0   mango         1              100
1  banana         2               50
2                 3                0
3  papaya         4               50
4     NaN         5                0
5     NaN         6                0

In [23]:
data.shape

(6, 3)

In [24]:
data.describe()

       quantity  price in rupees
count  6.000000         6.000000
mean   3.500000        33.333333
std    1.870829        40.824829
min    1.000000         0.000000
25%    2.250000         0.000000
50%    3.500000        25.000000
75%    4.750000        50.000000
max    6.000000       100.000000

In [25]:
#handling missing values

In [26]:
#checking missing value1
data.isnull().sum()

fruits             1
quantity           0
price in rupees    0
dtype: int64

In [27]:
#checking missing value 2
data.isna().sum()

fruits             1
quantity           0
price in rupees    0
dtype: int64

In [30]:
#deleting missing values from duplicate dataset data1
data1 = data

In [31]:
data1

   fruits  quantity  price in rupees
0   mango         1              100
1  banana         2               50
2                 3                0
3  papaya         4               50
4     NaN         5                0
5     NaN         6                0

In [32]:
data_drop=data1.dropna()

In [33]:
data_drop

   fruits  quantity  price in rupees
0   mango         1              100
1  banana         2               50
2                 3                0
3  papaya         4               50
4     NaN         5                0

In [34]:
#fill missing values in data

In [35]:
data_fil=data.fillna(0)

In [36]:
data_fil

   fruits  quantity  price in rupees
0   mango         1              100
1  banana         2               50
2                 3                0
3  papaya         4               50
4     NaN         5                0
5       0         6                0

In [42]:
#Creating dataframe to handle missing values in given dataset
dataframe = pd.DataFrame({'listvalues':[100,200,np.nan,np.nan,0,300,400,500,'',0]})

In [39]:
dataframe

  listvalues
0        100
1        200
2        NaN
3        NaN
4          0
5        300
6        400
7        500
8
9          0

In [40]:
dataframe.describe()

        listvalues
count            8
unique           7
top              0
freq             2

In [41]:
dataframe.shape

(10, 1)

In [43]:
#duplicate dataframe to dataset1

In [44]:
dataset1 = dataframe

In [46]:
dataset1 = dataframe.isnull().sum()

In [47]:
dataset1

listvalues    2
dtype: int64

In [49]:
dataframe

  listvalues
0        100
1        200
2        NaN
3        NaN
4          0
5        300
6        400
7        500
8
9          0

In [50]:
#missing value treatment for dataset1

In [55]:
dataset_fill = dataframe.fillna(0)

In [56]:
dataset_fill

  listvalues
0        100
1        200
2          0
3          0
4          0
5        300
6        400
7        500
8
9          0

In [57]:
dataset1

listvalues    2
dtype: int64

In [58]:
data_df = pd.DataFrame({'listvalues':[100,200,np.nan,np.nan,0,300,400,500,'',0]})

In [59]:
data_df

  listvalues
0        100
1        200
2        NaN
3        NaN
4          0
5        300
6        400
7        500
8
9          0

In [60]:
data_df1 = data_df

In [61]:
data_df_fill = data_df1.fillna(method='bfill')

In [62]:
data_df_fill

  listvalues
0        100
1        200
2          0
3          0
4          0
5        300
6        400
7        500
8
9          0

In [63]:
data_df2=data_df

In [64]:
data_df2

  listvalues
0        100
1        200
2        NaN
3        NaN
4          0
5        300
6        400
7        500
8
9          0

In [65]:
data_fill2 = data_df2.fillna(method = 'ffill')

In [66]:
data_fill2

  listvalues
0        100
1        200
2        200
3        200
4          0
5        300
6        400
7        500
8
9          0

In [70]:
data_df3 = data_df

In [75]:
data_df3

  listvalues
0        100
1        200
2        NaN
3        NaN
4          0
5        300
6        400
7        500
8
9          0

In [81]:
data_df3['listvalues'] = pd.to_numeric(data_df3['listvalues'])

In [82]:
data_df3['listvalues']

0    100.0
1    200.0
2      NaN
3      NaN
4      0.0
5    300.0
6    400.0
7    500.0
8      NaN
9      0.0
Name: listvalues, dtype: float64

In [85]:
data_df3['listvalues'] = data_df3.groupby(['listvalues']).mean()

DataError: No numeric types to aggregate